SET IDENTITY_INSERT [dbo].[Post] ON
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (10, N'2021-01-03 13:32:00', N'פלטת עזר לסייע למעמד בשלבי עבודה סופית', N'<p>לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר           מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר גק ליץ, ושבעגט. הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך           וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.          <h3>קולהע צופעט למרקוח</h3>          <p>צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.           תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.            הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה           ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.</p>          <h3>קולהע צופעט למרקוח</h3>', NULL)
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (11, N'2021-01-03 15:40:00', N'ציוד מכני כבד', N'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר           מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר גק ליץ, ושבעגט. הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך           וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.          <h3>קולהע צופעט למרקוח</h3>          <p>צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.           תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.            הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה           ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.</p>          <h3>קולהע צופעט למרקוח</h3>          <p>וסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי           מנורך.           נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק           לרטי.</p>         <h3>קולהע צופעט למרקוח</h3>          <p>צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.           תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.            הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה           ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.</p>          <h3>קולהע צופעט למרקוח</h3>          <p>וסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי           מנורך.           נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק           לרטי', NULL)
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (15, N'2021-01-04 00:18:00', N'מאמר נכבד', N'<br><br>
                הבלוג יעסוק בשאלות הרות משקל כגון:
                <ul>
                    <li> מה סוג המקדחה הנכון לרכישה?</li>
                    <li>איך בוחרים פועל אמין</li>
                    <li>מה זה בטון מזוין</li>
                    <li>ומהו ניסור ביטון יהלום?</li>
                    <li>האם אפשר לבודד כהוגן את הבית בבנייה שלי, ואיך?</li>
                    <br>וכדומה...
                </ul>', NULL)
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (20, N'2021-01-06 23:26:00', N'מאמר חשוב יותר', N'בותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקובותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקובותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקובותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקובותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקו
בותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקו
בותרצוע ורט בעוצבודה, העבות הענים וביעיל יים ביטחותיכם לדפו שלב עניים במין שלים ביעיקה לב השר מהשראה לערים לכם בקצות כל שלכל שתרצות בין שק הרגישו ממשמעוצ בעזרתיכה. וס. ואינים תוכן אדונות העניים מונות מונותנת ובי אוות הסקיפוגרפי מצות הניינדקס. מעות נפשכבר יצים משו בעצמהירתיים ללותרצוביטה למלל, דפיסו מים בבין שלב עוצבותר לל, יים לים לנסופורים יון עניתניתנים בבי מכיו אות במים לחזורים לב ענייצו חדש יעיקר, תוכל יעילות הטים לגרפיסו שתמונות ללה לדפיה. וב המספורט בקצובעות השתר לכם לכליטה במהיוחדש יעיצוין ענים בקו
', NULL)
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (21, N'2021-01-17 14:26:00', N'סוגריים בתוך סוגריים', N'<p>כאשר יש סוגריים בתוך סוגריים, קשה להחיל עליהם עיצוב על ידי גרפ בפעם אחת.</p>
<p>נניח שיש: &quot;(טקסט(טקסט)טקסט)טקסט&quot;</p>
<p>כאשר נריץ גרפ כזה: \(.+?\)</p>
<p>התוצאה תהיה זו:</p>
<p>&quot;<strong>(טקסט(טקסט)</strong>טקסט)טקסט&quot;</p>
<p>אז כתבתי סקריפט נחמד שמחיל סגנון תו בשם &quot;סוגריים&quot; על כל תוכן שבסוגריים שבמסמך.<br />
גם עם בתוכו יש עוד סוגריים, ואף כמה פעמים. זה לא מבלבל!</p>
<p>הערה: מחיל סגנוןו תו בשם &quot;סוגריים&quot; אם הוא כבר קיים, הסקריפט ישתמש בו.</p>
<p>מחיר הסקריפט הוא 50</p>
<pre>---------------------------------
הסבר טכני למעוניינים:
הסקריפט מריץ גרפ זה:\(([^\(]|~F)+?\)
מחיל על התוצאה סגנון תו בשם "סוגריים"
מריץ גרפ נוסף ומחליף על תווי סוגריים שמוחל עליהם העיצוב הנ"ל לקוד הבא:
(= @BEGIN
)= @AFTER
כעת הוא חוזר שוב על הפעולה, ומכיוון שסמני הסוגריים  "נעלמו" הוא מאתר סבב נוסף של סוגריים.
וחזור חלילה, עד שאין יותר סמני סוגריים פותחים וסוגרים במסמך.

כעת הוא מחפש את הקודים ומחליף חזרה לסוגריים...
זהו.

</pre>', NULL)
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (22, N'2021-01-17 15:06:00', N'סטים של אופן טייפ', N'			<p>שלום!</p>
<p>[אזהרה  — פוסט טכני ביותר]</p>
<p>שאלני חבר, האם ניתן לבטל סט של אופן טייפ מתוצאות חיפוש מסויים. (היה צורך לבטל ההגדר של &quot;שווא נע&quot; משמות הוויה)</p>
<p>אז בדקתי.</p>
<p>וגיליתי שהדבר מסובך עד להחריד&#8230;.</p>
<p>ואסכם מה שהעלתי:</p>
<p>בהתחלה הייתי משוכנע שזה יהיה קל, לבטל יש קבוע לכל סט, ו&quot;נדליק&quot; או &quot;נכבה&quot; משהו כזה:</p>
<p style="text-align:left;">myArray[index].otfStylisticSets1=false;</p>
<p style="direction:rtl;text-align:right;">התברר שאין כאלו קבועים.</p>
<p style="direction:rtl;text-align:right;">אז חשבתי אולי זה מערך, משהו כזה:</p>
<p style="text-align:left;">myArray[index].otfStylisticSets=[1,3,18];</p>
<p style="direction:rtl;text-align:right;">כאשר המספרים אלו מספרי הסטים.</p>
<p style="direction:rtl;text-align:right;">טוב,<br />
גם זה לא.</p>
<p style="direction:rtl;text-align:right;">אז חפשתי ומצאתי שיש הגדרה כזו בלבד: myArray[index].otfStylisticSet<br />
ועליה לקבל רק מספר. ותו לא!<br />
איך מספר יכיל את כל סוגי הסטים?!</p>
<p style="direction:rtl;text-align:right;">בדקתי מהם המספרים של הסטים על ידי הסקריפט הפשוט הבא: alert(app.activeDocument.selection[0].otfStylisticSets);</p>
<p style="direction:rtl;text-align:right;">והתברר לי שהם כפולות של 2!</p>
<p style="direction:rtl;text-align:right;">למשל, סט 1 זה <strong>2</strong>, סט 2 זה <strong>4</strong>, סט 3 זה <strong>8</strong>! וכן הלאה.</p>
<p style="direction:rtl;text-align:right;">למעשה זה מספרי הסטים:</p>
<p style="direction:rtl;text-align:right;padding-right:120px;">1. 2<br />
2. 4<br />
3. 8<br />
4. 16<br />
5. 32<br />
6. 64<br />
7. 128<br />
8. 256<br />
9. 512<br />
10. 1024<br />
11. 2048<br />
12. 4096<br />
13. 8192<br />
14. 16384<br />
15. 32768<br />
16. 65536<br />
17. 131072<br />
18. 262144<br />
19. 524288<br />
20. 1048576</p>
<p style="direction:rtl;text-align:right;">את זה מצאתי בקלות על ידי הסקריפט הזה:</p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">var num=2;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">var myPars=app.activeDocument.selection[0].parentStory.paragraphs.everyItem().getElements();</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">myPars[0].otfStylisticSets=num;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">myPars[0].contents=num+&quot;\t&quot;+myPars[0].contents;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">for (i=1; i&lt;myPars.length; i++){ </span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">if(num==1048576){num=1;}</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">num=num*2;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">myPars[i].otfStylisticSets=num;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">myPars[i].contents=num+&quot;\t&quot;+myPars[i].contents;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">}</span></p>
<p style="direction:rtl;">כעת התברר שקל מאד להחיל סטים על ידי חיבור המספרים זה עם זה.</p>
<p style="direction:rtl;">נניח אם רצוני להחיל סט 2 וסט 3, עלי לכתוב ככה: <span style="line-height:1.7;">;(myPars[i].otfStylisticSets=12//=(4+8</span></p>
<p style="direction:rtl;">טוב, ולבקשתו של חברי: כתבתי את הסקריפט הזה:</p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">var num= prompt(&quot;הזן מספר סט לפי החישוב, 1 הוא 2 2 הוא 4 וכן הלאה&quot;,&quot;&quot;);</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">(!num)?exit():&quot;&quot;;</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">var oldArray=app.activeDocument.findGrep(true);</span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">for (i=0; i&lt;oldArray.length; i++){ </span></p>
<p style="direction:ltr;text-align:left;"><span style="line-height:1.7;">oldArray[i].otfStylisticSets=oldArray[i].otfStylisticSets-(num*1);</span></p>
<p style="direction:ltr;"><span style="line-height:1.7;">}</span></p>
<p style="direction:rtl;">דא עקא, חייבים לדייק מאד. ולחפש רק טקסט שידוע שיש לו סט רצוי. שרוצים להחסיר אותו.</p>
<p style="direction:rtl;">כי אם נחפש למשל סתם טקסט, וננסה לבטל ממנו סט ש<strong>אין לו כלל</strong>, זה יהרוס את המספר של הסט שלו, כי המסר שיקבל לא יהיה מתאים לשום סט, וזה ישבש את כל העסק&#8230;</p>
<pre style="direction:rtl;">הערה: כל שימוש בקוד המופיע בפוסט הוא באחריות המשתמש בלבד.</pre>', NULL)
INSERT INTO [dbo].[Post] ([Id], [PublishDate], [Title], [BodyText], [UserId]) VALUES (24, N'2021-01-19 15:10:00', N'איך להתמודד עם עבודה בעידן הקורונה', N'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר           מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר גק ליץ, ושבעגט. הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך           וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.          <h3>קולהע צופעט למרקוח</h3>          <p>צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.           תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.            הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה           ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.</p>          <h3>קולהע צופעט למרקוח</h3>          <p>וסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי           מנורך.           נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק           לרטי.</p>         <h3>קולהע צופעט למרקוח</h3>          <p>צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.           תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.            הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה           ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.</p>          <h3>קולהע צופעט למרקוח</h3>          <p>וסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי           מנורך.           נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק           לרטי', NULL)
SET IDENTITY_INSERT [dbo].[Post] OFF
